## Import Modules

In [1]:
import numpy as np
import pandas as pd

## Main Programm

In [2]:
# Create Empty DataFrame with pandas
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
# Create Custom DataFrame with pandas
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[27,67,45,89],[9,10,11,12],[13,14,15,16,17]], columns=['A','B','C','D','E'])

In [5]:
df1

    A   B   C   D     E
0   1   2   3   4   NaN
1   5   6   7   8   NaN
2  27  67  45  89   NaN
3   9  10  11  12   NaN
4  13  14  15  16  17.0

In [6]:
df1.head(3)

    A   B   C   D   E
0   1   2   3   4 NaN
1   5   6   7   8 NaN
2  27  67  45  89 NaN

In [7]:
df1.tail(3)

    A   B   C   D     E
2  27  67  45  89   NaN
3   9  10  11  12   NaN
4  13  14  15  16  17.0

In [8]:
df1.shape

(5, 5)

In [9]:
df1.iloc[0,1]

2

In [10]:
df1.iloc[0:2,0:3]

   A  B  C
0  1  2  3
1  5  6  7